#1、请将 "1,2,3"，变成 ["1","2","3"]
a = "1,2,3"
a = [ x for x in a  if x.isdigit() ] 
print(a)
#2、使用Python copy一个文件，从a目录,copy文件到b目录
with open("/root/test","r") as fr:
    with open("/tmp/test","w") as fw:
        fw.write(fr.read())
#3、以下代码输出什么，请解释原因(写到问题下方):
li = [ [ ] ] * 5   #创建5个空的嵌套列表  [ [] ,[], [], [], [] ]
li[0].append(10) #  [ [10] ,[10] ,[10], [10], [10], ]
print(li)
li[1].append(20) # [[10,20] ,[10,20], [10,20], [10,20],[10,20 ]]
print(li)
li.append(30) #[[10,20] ,[10,20], [10,20], [10,20],[10,20 ],30]
print(li)

# * 都是对前面的值进行引用，对于可变的数据类型，因判断是否需要此特性 否则就需要写成 li = 【 【】 【】 【】 【】 【】 】
